---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.PointCloudsRootPath
source: html/d87e5ed0-d36f-b6f6-4b86-3fad656dd93d.htm
---
# Autodesk.Revit.ApplicationServices.Application.PointCloudsRootPath Property

Root path for point cloud files.

## Syntax (C#)
```csharp
public string PointCloudsRootPath { get; }
```